README.org
#+title: README Entrega 25/04
#+options: h:1 num:nil toc:nil
* Correr el servidor de forma local

** Para iniciar el servidor:  
#+begin_src bash
npm start
#+end_src


** Iniciar el servidor con nodemon para desarrollo:
#+begin_src bash
npm test
#+end_src

** El servidor intenta conectarse a una base de datos, por defecto en alguna de urls: 
#+begin_src bash
mongodb://127.0.0.1:27017/ecommerce

mongodb://localhost:27017/ecommerce
#+end_src




** Se puede cambiar el string de conexión a la base de datos en 
   #+begin_src bash
src/config/mongoose.config.js   
   #+end_src



* Notas a esta entrega

** Agregado Passport para autenticación

** Agregada estrategia de autenticación local con Passport

** Agregado hasheo de contraseña para autenticación local con bcrypt

** Agregada estrategia de autenticación con github
